def process_score(score):
    if score == 10:
        print("შენი მიღებული ქულა უდრის 10-ს. გისწავლის მოსწავლეს და შენი მშობელისთვის ამაშინ აქვს შეტყობინება.")
    elif score == 8 or score == 9:
        print("შენი მიღებული ქულა უდრის 8-ს ან 9-ს. შენი მშობელისთვის მასწავლებელმა პატარა შენიშვნა მისცეს.")
    elif score == 5:
        print("შენი მიღებული ქულა უდრის 5-ს. შენი მშობელისთვის მასწავლებელმა გააგდოს შენიშვნა.")
    else:
        print("შენი მიღებული ქულა ნაკლებია 5-ზე. შენი მშობელისთვის მასწავლებელმა გააგდოს შენახვა სკოლიდან.")

# აქ შეიძლება შეცვლა score ცვლადის შესაბამის ტესტის ნიშნად
score = int(input("შეიყვანეთ თქვენი ქულა: "))
process_score(score)
